[
    "async function;asynchrone Funktion. gibt ein Promise Objekt zurück",
    "await;Operator innerhalb von async function. wartet auf Promise",
    "CORS;Cross-Origin Resource Sharing",
    "Promise;Art Wrapper für asynchrone Operationen/Ereignisse. gibt Zugriff auf das Egebnis Erfolg oder Fehlschlag",

    "Daten;enthalten Informationen, die sie abbilden",
    "Informationen;Interpretation von Daten",
    "Aggregation;Assoziation. beschreibt Ganzes zu seinen Teilen. Teile können unabhängig von Ganzen existieren (Bibliothek - Buch)",
    "Komposition;Assoziation. beschreibt Ganzes zu seinen Teilen. Teile sind vom Ganzen existentiell abhängig (Haus - Raum)",
    "Konstruktor;erste Methode, die bei der Erstellung eines Objekts aufgerufen wird. Wird häufig zum Initialisieren der Attribute eingesetzt",
    "Destruktor;letzte Methode, die vor der Zerstörung eines Objekts aufgerufen wird. meist vom Garbage Collector aufgerufen. Wird häufig zum Freigeben von Resourcen verwendet",
    "Garbage Collector;automatische Speicherbereinigung während der Laufzeit. entfernt alle nicht-referenzierten Objekte (die nicht mehr \"errreicht\" werden)",
    "Vererbung;aus vorhandener Klasse wird neue Klasse abgeleitet. Kindklassen erben Methoden/Attribute ihrer Elternklassen",
    "Klasse;Datenstruktur. ein Bauplan für ein Objekt",
    "Objekt;Instanz einer Klasse. konkretes Exemplar: Attribute werden mit Daten gefüllt -> Speicher wird reserviert)",
    "Abstrakte Klasse;keine Instanz von ihr möglich. enthält min 1 Methodensignatur",
    "Interface;Abstrakte Klasse. gibt an welche Methoden implementiert werden müssen durch die Methodensignatur",
    "Methodensignatur;besteht aus Namen, Parameter (Anzahl, Reihenfolge oder Typ), evtl. Rückgabewert und Zugriffsmodifikator",
    "public;Zugriffsmodifikator - jeder kann Methode/Attribut aufrufen",
    "private;Zugriffsmodifikator - nur innerhalb der Klasse und aller von ihr abgeleiteten Klassen",
    "protected;Zugriffsmodifikator - nur klassenintern",
    "Überladen;Operatoren - \"+\" verketten und addieren. Methoden - unterschiedliche Anzahl an Parametern mit unterschiedlichem Datentyp",
    "Überschreiben;erlaubt der abgeleiteten Klasse eine eigene Implementierung einer geerbten Methode. keine statischen Methoden. Name, Parameter und Rückgabetyp müssen gleich sein",
    "statische Methode;Methode einer Klasse. die ohne Instanziierung genutzt werden kann"
]